Revit 2027 API
Subelement.Category Property
Retrieves a Category object that represents the category or sub category of the subelement.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Category Category { get; }
Public ReadOnly Property Category As Category
	Get
public:
property Category^ Category {
	Category^ get ();
}
member Category : Category with get
Property Value
Category
Remarks
All category objects can be retrieved from the application by using the Categories property of the Application.Settings object.
See Also
Reference
Subelement Class
Autodesk.Revit.DB Namespace